app/Controllers/Blog.php

    public function index(){
        $postModel = new PostModel(); // Cria instância do model de posts
        $posts = $postModel->findAll(); // Recupera todos os posts do banco
---
SELECT *
FROM `posts`

    public function detalhe($id){
        $postModel = new PostModel();
        $commentModel = new CommentModel();
        $post = $postModel->find($id); // Busca post pelo ID
---
SELECT *
FROM `posts`
WHERE `posts`.`id` = '2'

    public function editar($id)
    {
        $postModel = new PostModel();
        $post = $postModel->find($id); // Busca post pelo ID
---
SELECT *
FROM `posts`
WHERE `posts`.`id` = '2'

    public function atualizar($id){
        $postModel = new PostModel();
        $post = $postModel->find($id); // Busca post pelo ID

        if (!$post) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Post $id não encontrado");
        }

        $title = $this->request->getPost('title');   // Novo título
        $content = $this->request->getPost('content'); // Novo conteúdo

        $data = [
            'id' => $id,
            'title'   => $title,
            'content' => $content
        ];

        $postModel->update($id, $data); // Atualiza no banco
---
SELECT *
FROM `posts`
WHERE `posts`.`id` = '9'
UPDATE `posts` SET `title` = 'O Futuro do 5G: Mais do que apenas internet rápida', `content` = 'O 5G promete transformar a forma como nos conectamos, trazendo velocidades de internet móvel muito superiores às atuais e uma latência mínima. Isso não significa apenas downloads mais rápidos: o 5G será fundamental para o avanço da Internet das Coisas (IoT), veículos autônomos e realidade aumentada.\r\nAlém disso, setores como saúde, educação e indústria poderão aproveitar a conectividade ultra-rápida para implementar soluções inovadoras, tornando processos mais eficientes e experiências mais interativas para os usuários'
WHERE `posts`.`id` IN ('9')

    public function excluir($id){
        $postModel = new PostModel();
        $post = $postModel->find($id); // Busca post pelo ID

        if (!$post) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Post $id não encontrado");
        }
        else{
            $postModel->delete($id); // Exclui o post
---
SELECT *
FROM `posts`
WHERE `posts`.`id` = '10'
DELETE FROM `posts`
WHERE `id` IN ('10')