app/Models/CommentModel.php

    public function getCommentsByPost($postId)
    {
        return $this->select('comments.*, users.username') //Pega todos os campos de comments e também o username do autor, que está na tabela users
                    ->join('users', 'users.id = comments.user_id') //Faz o JOIN (junção) entre comments e users, para sabermos quem comentou
                    ->where('comments.post_id', $postId) //Filtra para mostrar só os comentários do post atual
                    ->orderBy('comments.created_at', 'DESC') //Ordena os comentários do mais recente para o mais antigo.
                    ->findAll(); //Busca os resultados e retorna como um array
---
SELECT `comments`.*, `users`.`username`
FROM `comments`
JOIN `users` ON `users`.`id` = `comments`.`user_id`
WHERE `comments`.`post_id` = '2'
ORDER BY `comments`.`created_at` DESC

    public function addComment($postId, $userId, $content)
    {
        $data = [
            'post_id'  => $postId,
            'user_id'  => $userId,
            'content'  => $content
        ];

        return $this->insert($data);
---
INSERT INTO `comments` (`post_id`, `user_id`, `content`, `created_at`, `updated_at`) VALUES ('2', '2', 'Me interessei muito!', '2025-09-02 18:35:50', '2025-09-02 18:35:50')